---
kind: type
id: T:Autodesk.Revit.DB.Architecture.RailSupportsLayout
source: html/58c35d10-0327-cea3-18a3-6ee3db6ddb4c.htm
---
# Autodesk.Revit.DB.Architecture.RailSupportsLayout

The layout of the rail supports.

## Syntax (C#)
```csharp
public enum RailSupportsLayout
```